app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description") VALUES ($1, $2) RETURNING "id"  [["title", "A thing"], ["description", "a description"]]
---
    task = Task.new({
      title: params[:task][:title],
      description: params[:task][:description]
      })

    task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1 WHERE "tasks"."id" = $2  [["description", "sfgbsfb"], ["id", 3]]
---
  task = Task.find(params[:id])
  task.update({
    title: params[:task][:title],
    description: params[:task][:description]
    })